RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
/**
 *******************************************************************************
 * @file  hc32f4a0_pwc.c
 * @brief This file provides firmware functions to manage the Power Control(PWC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Zhangxl         First version
   2020-07-30       Zhangxl         Refine power mode switch function
   2020-08-25       Zhangxl         Modify for MISRAC2012-10.1
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_pwc.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_PWC PWC
 * @brief Power Control Driver Library
 * @{
 */

#if (DDL_PWC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup PWC_Local_Macros PWC Local Macros
 * @{
 */

/* Get the backup register address of PWC */
#define PWC_BKRx(num)       ((uint32_t)(&(M4_PWC->BKR0)) + ((uint32_t)(num) << 2U))

#define PWC_FCG0_MASK                                                           \
                (PWC_FCG0_DCU8   | PWC_FCG0_DCU7 | PWC_FCG0_DCU6    |           \
                PWC_FCG0_DCU5    | PWC_FCG0_DCU4 | PWC_FCG0_DCU3    |           \
                PWC_FCG0_DCU2    | PWC_FCG0_DCU1 | PWC_FCG0_CRC     |           \
                PWC_FCG0_TRNG    | PWC_FCG0_HASH | PWC_FCG0_AES     |           \
                PWC_FCG0_CORDIC  | PWC_FCG0_CTC  | PWC_FCG0_AOS     |           \
                PWC_FCG0_FCM     | PWC_FCG0_DMA2 | PWC_FCG0_DMA1    |           \
                PWC_FCG0_KEY     | PWC_FCG0_SRAMB| PWC_FCG0_SRAM4   |           \
                PWC_FCG0_SRAM3   | PWC_FCG0_SRAM2| PWC_FCG0_SRAM1   |           \
                PWC_FCG0_SRAMH)

#define PWC_FCG1_MASK                                                           \
                (PWC_FCG1_CAN1   | PWC_FCG1_CAN2 | PWC_FCG1_ETHER   |           \
                PWC_FCG1_QSPI    | PWC_FCG1_IIC1 | PWC_FCG1_IIC2    |           \
                PWC_FCG1_IIC3    | PWC_FCG1_IIC4 | PWC_FCG1_IIC5    |           \
                PWC_FCG1_IIC6    | PWC_FCG1_SDIOC1|PWC_FCG1_SDIOC2  |           \
                PWC_FCG1_I2S1    | PWC_FCG1_I2S2 | PWC_FCG1_I2S3    |           \
                PWC_FCG1_I2S4    | PWC_FCG1_SPI1 | PWC_FCG1_SPI2    |           \
                PWC_FCG1_SPI3    | PWC_FCG1_SPI4 | PWC_FCG1_SPI5    |           \
                PWC_FCG1_SPI6    | PWC_FCG1_USBFS| PWC_FCG1_USBHS   |           \
                PWC_FCG1_FMAC1   | PWC_FCG1_FMAC2| PWC_FCG1_FMAC3   |           \
                PWC_FCG1_FMAC4)
#define PWC_FCG2_MASK                                                           \
                (PWC_FCG2_TMR6_1| PWC_FCG2_TMR6_2 | PWC_FCG2_TMR6_3 |           \
                PWC_FCG2_TMR6_4 | PWC_FCG2_TMR6_5 | PWC_FCG2_TMR6_6 |           \
                PWC_FCG2_TMR6_7 | PWC_FCG2_TMR6_8 | PWC_FCG2_TMR4_1 |           \
                PWC_FCG2_TMR4_2 | PWC_FCG2_TMR4_3 | PWC_FCG2_HRPWM  |           \
                PWC_FCG2_TMR0_1 | PWC_FCG2_TMR0_2 | PWC_FCG2_EMB    |           \
                PWC_FCG2_TMR2_1 | PWC_FCG2_TMR2_2 | PWC_FCG2_TMR2_3 |           \
                PWC_FCG2_TMR2_4 | PWC_FCG2_TMRA_1 | PWC_FCG2_TMRA_2 |           \
                PWC_FCG2_TMRA_3 | PWC_FCG2_TMRA_4 | PWC_FCG2_TMRA_5 |           \
                PWC_FCG2_TMRA_6 | PWC_FCG2_TMRA_7 | PWC_FCG2_TMRA_8 |           \
                PWC_FCG2_TMRA_9 | PWC_FCG2_TMRA_10| PWC_FCG2_TMRA_11|           \
                PWC_FCG2_TMRA_12)
#define PWC_FCG3_MASK                                                           \
                (PWC_FCG3_ADC1  | PWC_FCG3_ADC2   | PWC_FCG3_ADC3   |           \
                PWC_FCG3_DAC1   | PWC_FCG3_DAC2   | PWC_FCG3_CMP1   |           \
                PWC_FCG3_CMP2   | PWC_FCG3_OTS    | PWC_FCG3_DVP    |           \
                PWC_FCG3_SMC    | PWC_FCG3_DMC    | PWC_FCG3_NFC    |           \
                PWC_FCG3_USART1 | PWC_FCG3_USART2 | PWC_FCG3_USART3 |           \
                PWC_FCG3_USART4 | PWC_FCG3_USART5 | PWC_FCG3_USART6 |           \
                PWC_FCG3_USART7 | PWC_FCG3_USART8 | PWC_FCG3_USART9 |           \
                PWC_FCG3_USART10| PWC_FCG3_CMBIAS)

#define PWC_RAM_MASK                                                            \
                (PWC_RAMPC0_RAMPDC0 | PWC_RAMPC0_RAMPDC1 | PWC_RAMPC0_RAMPDC2 | \
                PWC_RAMPC0_RAMPDC3  | PWC_RAMPC0_RAMPDC4 | PWC_RAMPC0_RAMPDC5 | \
                PWC_RAMPC0_RAMPDC6  | PWC_RAMPC0_RAMPDC7 | PWC_RAMPC0_RAMPDC8 | \
                PWC_RAMPC0_RAMPDC9  | PWC_RAMPC0_RAMPDC10)

#define PWC_PRAM_MASK                                                           \
                (PWC_PRAMLPC_PRAMPDC0   | PWC_PRAMLPC_PRAMPDC1 |                \
                PWC_PRAMLPC_PRAMPDC2    | PWC_PRAMLPC_PRAMPDC3 |                \
                PWC_PRAMLPC_PRAMPDC4    | PWC_PRAMLPC_PRAMPDC5 |                \
                PWC_PRAMLPC_PRAMPDC6    | PWC_PRAMLPC_PRAMPDC7 |                \
                PWC_PRAMLPC_PRAMPDC8    | PWC_PRAMLPC_PRAMPDC9)

#define PWC_PVD_FLAG_MASK                                                       \
                (PWC_PVDDSR_PVD1MON     | PWC_PVDDSR_PVD1DETFLG|                \
                PWC_PVDDSR_PVD2MON      | PWC_PVDDSR_PVD2DETFLG)

#define PWC_PDWK0_MASK                                                          \
                (PWC_PDWKE0_WKE0_0  | PWC_PDWKE0_WKE0_1     |                   \
                PWC_PDWKE0_WKE0_2   | PWC_PDWKE0_WKE0_3     |                   \
                PWC_PDWKE0_WKE1_0   | PWC_PDWKE0_WKE1_1     |                   \
                PWC_PDWKE0_WKE1_2   | PWC_PDWKE0_WKE1_3)

#define PWC_PDWK1_MASK                                                          \
                (PWC_PDWKE1_WKE2_0  | PWC_PDWKE1_WKE2_1     |                   \
                PWC_PDWKE1_WKE2_2   | PWC_PDWKE1_WKE2_3     |                   \
                PWC_PDWKE1_WKE3_0   | PWC_PDWKE1_WKE3_1     |                   \
                PWC_PDWKE1_WKE3_2   | PWC_PDWKE1_WKE3_3)

#define PWC_PDWK2_MASK                                                          \
                (PWC_PDWKE2_VD1WKE  | PWC_PDWKE2_VD2WKE     |                   \
                PWC_PDWKE2_RTCPRDWKE| PWC_PDWKE2_RTCALMWKE  |                   \
                PWC_PDWKE2_WKTMWKE  | PWC_PDWKE2_XTAL32ERWKE)

#define PWC_PDWK_FLG0_MASK                                                      \
                (PWC_PDWKF0_PTWK0F  | PWC_PDWKF0_PTWK1F     |                   \
                PWC_PDWKF0_PTWK2F   | PWC_PDWKF0_PTWK3F     |                   \
                PWC_PDWKF0_VD1WKF   | PWC_PDWKF0_VD2WKF)

