RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
#define PWC_PDWK_FLG1_MASK                                                      \
                (PWC_PDWKF1_RTCPRDWKF   | PWC_PDWKF1_RTCALMWKF  |               \
                PWC_PDWKF1_XTAL32ERWKF  | PWC_PDWKF1_WKTMWKF)

/**
 * @defgroup PWC_Check_Parameters_Validity PWC Check Parameters Validity
 * @{
 */
/*  Check PWC register lock status. */
#define IS_PWC_UNLOCKED()       ((M4_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1)

/*  Check PWC PVD register lock status. */
#define IS_PVD_UNLOCKED()       ((M4_PWC->FPRC & PWC_FPRC_FPRCB3) == PWC_FPRC_FPRCB3)

#define IS_PWC_FCG0_UNLOCKED()  ((M4_PWC->FCG0PC & PWC_FCG0PC_PRT0) == PWC_FCG0PC_PRT0)

/*! Parameter validity check for peripheral in fcg0. */
#define IS_PWC_FCG0_PERIPH(per)                                                 \
(   ((per) != 0x00UL)                           &&                              \
    (((per) | PWC_FCG0_MASK) == PWC_FCG0_MASK))

/*! Parameter validity check for peripheral in fcg1. */
#define IS_PWC_FCG1_PERIPH(per)                                                 \
(   ((per) != 0x00UL)                           &&                              \
    (((per) | PWC_FCG1_MASK) == PWC_FCG1_MASK))

/*! Parameter validity check for peripheral in fcg2. */
#define IS_PWC_FCG2_PERIPH(per)                                                 \
(   ((per) != 0x00UL)                           &&                              \
    (((per) | PWC_FCG2_MASK) == PWC_FCG2_MASK))

/*! Parameter validity check for peripheral in fcg3. */
#define IS_PWC_FCG3_PERIPH(per)                                                 \
(   ((per) != 0x00UL)                           &&                              \
    (((per) | PWC_FCG3_MASK) == PWC_FCG3_MASK))

/*! Parameter validity check for internal RAM setting of power mode control */
#define IS_PWC_RAM_CONTROL(ram)                                                 \
(   ((ram) != 0x00UL)                           &&                              \
    (((ram) | PWC_RAM_MASK) == PWC_RAM_MASK))

/*! Parameter validity check for peripheral RAM setting of power mode control */
#define IS_PWC_PRAM_CONTROL(pram)                                               \
(   ((pram) != 0x00UL)                          &&                              \
    (((pram) | PWC_PRAM_MASK) == PWC_PRAM_MASK))

/*! Parameter validity check for RAM setting of MCU operating mode */
#define IS_PWC_RAM_MODE(mode)                                                   \
(   ((mode) == PWC_RAM_HIGH)                    ||                              \
    ((mode) == PWC_RAM_LOW))

/*! Parameter validity check for PVD channel. */
#define IS_PWC_PVD_CH(ch)                                                       \
(   ((ch) == PWC_PVD_CH1)                       ||                              \
    ((ch) == PWC_PVD_CH2))

/*! Parameter validity check for PVD2 ext. input function setting. */
#define IS_PWC_PVD2_EXINP(func)                                                 \
(   ((func) == PWC_PVD2_EXINP_ON)               ||                              \
    ((func) == PWC_PVD2_EXINP_OFF))

/*! Parameter validity check for PVD function setting. */
#define IS_PWC_PVD_EN(func)                                                     \
(   ((func) == PWC_PVD_ON)                      ||                              \
    ((func) == PWC_PVD_OFF))

/*! Parameter validity check for PVD interrupt or reset function setting. */
#define IS_PWC_PVD_IR_EN(func)                                                  \
(   ((func) == PWC_PVD_IR_ON)                   ||                              \
    ((func) == PWC_PVD_IR_OFF))

/*! Parameter validity check for PVD interrupt or reset selection. */
#define IS_PWC_PVD_IR_SEL(sel)                                                  \
(   ((sel) == PWC_PVD_RST)                      ||                              \
    ((sel) == PWC_PVD_INT))

/*! Parameter validity check for PVD compare output setting. */
#define IS_PWC_PVD_CMP_EN(out)                                                  \
(   ((out) == PWC_PVD_CMP_ON)                   ||                              \
    ((out) == PWC_PVD_CMP_OFF))

/*! Parameter validity check for PVD digital noise filter function setting. */
#define IS_PWC_PVD_DFS_EN(func)                                                 \
(   ((func) == PWC_PVD_DF_ON)                   ||                              \
    ((func) == PWC_PVD_DF_OFF))

/*! Parameter validity check for PVD digital noise filter clock setting. */
#define IS_PWC_PVD_DFS_CLK(clk)                                                 \
(   ((clk) == PWC_PVD_DFS_DIV1)                 ||                              \
    ((clk) == PWC_PVD_DFS_DIV2)                 ||                              \
    ((clk) == PWC_PVD_DFS_DIV4)                 ||                              \
    ((clk) == PWC_PVD_DFS_MUL2))

/*! Parameter validity check for PVD detect voltage setting. */
#define IS_PWC_PVD_VOLTAGE(vol)                                                 \
(   ((vol) == PWC_PVD1_2V0_PVD2_2V1)            ||                              \
    ((vol) == PWC_PVD1_2V1_PVD2_2V3)            ||                              \
    ((vol) == PWC_PVD1_2V3_PVD2_2V5)            ||                              \
    ((vol) == PWC_PVD1_2V5_PVD2_2V6)            ||                              \
    ((vol) == PWC_PVD1_2V6_PVD2_2V7)            ||                              \
    ((vol) == PWC_PVD1_2V7_PVD2_2V8)            ||                              \
    ((vol) == PWC_PVD1_2V8_PVD2_2V9)            ||                              \
    ((vol) == PWC_PVD1_2V9_PVD2_1V1))

/*! Parameter validity check for PVD NMI function setting. */
#define IS_PWC_PVD_NMI(func)                                                    \
(   ((func) == PWC_PVD_INT_MASK)                ||                              \
    ((func) == PWC_PVD_INT_NONMASK))

/*! Parameter validity check for PVD trigger setting. */
#define IS_PWC_PVD_TRIG(trig)                                                   \
(   ((trig) == PWC_PVD_TRIGGER_FALLING)         ||                              \
    ((trig) == PWC_PVD_TRIGGER_RISING)          ||                              \
    ((trig) == PWC_PVD_TRIGGER_BOTH))

/*! Parameter validity check for PVD flag. */
#define IS_PWC_PVD_GET_FLAG(flag)                                               \
(   ((flag) != 0x00U)                           &&                              \
    (((flag) | PWC_PVD_FLAG_MASK) == PWC_PVD_FLAG_MASK))

/*! Parameter validity check for wakeup0 event. */
#define IS_PWC_WAKEUP0_EVENT(evt)                                               \
(   ((evt) != 0x00U)                            &&                              \
    (((evt) | PWC_PDWK0_MASK) == PWC_PDWK0_MASK))

/*! Parameter validity check for wakeup1 event. */
#define IS_PWC_WAKEUP1_EVENT(evt)                                               \
(   ((evt) != 0x00U)                            &&                              \
    (((evt) | PWC_PDWK1_MASK) == PWC_PDWK1_MASK))

