RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
/*! Parameter validity check for wakeup2 event. */
#define IS_PWC_WAKEUP2_EVENT(evt)                                               \
(   ((evt) != 0x00U)                            &&                              \
    (((evt) | PWC_PDWK2_MASK) == PWC_PDWK2_MASK))

/*! Parameter validity check for wakeup0 flag. */
#define IS_PWC_WAKEUP0_FLAG(flag)                                               \
(   ((flag) != 0x00U)                           &&                              \
    (((flag) | PWC_PDWK_FLG0_MASK) == PWC_PDWK_FLG0_MASK))

/*! Parameter validity check for wakeup1 flag. */
#define IS_PWC_WAKEUP1_FLAG(flag)                                               \
(   ((flag) != 0x00U)                           &&                              \
    (((flag) | PWC_PDWK_FLG1_MASK) == PWC_PDWK_FLG1_MASK))

/*! Parameter validity check for power down mode wakeup event with trigger. */
#define IS_PWC_WAKEUP_TRIG_EVENT(evt)                                           \
(   ((evt) != 0x00U)                            &&                              \
    (((evt) | PWC_PD_WKUP_TRIG_MASK) == PWC_PD_WKUP_TRIG_MASK))

/*! Parameter validity check for power down mode wakeup trigger edge. */
#define IS_PWC_WAKEUP_TRIG(edge)                                                \
(   ((edge) == PWC_PD_WKUP_FALLING)             ||                              \
    ((edge) == PWC_PD_WKUP_RISING))

/*! Parameter validity check for wake up flag. */
#define IS_PWC_WKUP0_FLAG(flag)                                                 \
(   ((flag) != 0x00U)                           &&                              \
    (((flag) | PWC_PDWK_FLG0_MASK) == PWC_PDWK_FLG0_MASK))

/*! Parameter validity check for wake up flag. */
#define IS_PWC_WKUP1_FLAG(flag)                                                 \
(   ((flag) != 0x00U)                           &&                              \
    (((flag) | PWC_PDWK_FLG1_MASK) == PWC_PDWK_FLG1_MASK))

/*! Parameter validity check for stop mode drive capacity. */
#define IS_PWC_STOP_DRV(drv)                                                    \
(   ((drv) == PWC_STOP_DRV_HIGH)                ||                              \
    ((drv) == PWC_STOP_DRV_LOW))

/*! Parameter validity check for clock setting after wake-up from stop mode. */
#define IS_PWC_STOP_CLK(clk)                                                    \
(   ((clk) == PWC_STOP_CLK_KEEP)                ||                              \
    ((clk) == PWC_STOP_CLK_MRC))

/*! Parameter validity check for flash wait setting after wake-up from stop mode. */
#define IS_PWC_STOP_FLASH_WAIT(wait)                                            \
(   ((wait) == PWC_STOP_FLASH_WAIT)             ||                              \
    ((wait) == PWC_STOP_FLASH_NOWAIT))

/*! Parameter validity check for ex-bus setting in stop mode. */
#define IS_PWC_STOP_EXBUS(bus)                                                  \
(   ((bus) == PWC_STOP_EXBUS_HIZ)               ||                              \
    ((bus) == PWC_STOP_EXBUS_HOLD))

/*! Parameter validity check for VBAT Reference Voltage. */
#define IS_PWC_VBAT_REF_VOL(vol)                                                \
(   ((vol) == PWC_VBAT_REF_VOL_2P0V)            ||                              \
    ((vol) == PWC_VBAT_REF_VOL_1P8V))

/*! Parameter validity check for BACKUP RAM Flag. */
#define IS_PWC_BACKUP_RAM_FLAG(flag)                                            \
(   0U != ((flag) & (PWC_BACKUP_RAM_FLAG_RAMPDF | PWC_BACKUP_RAM_FLAG_RAMVALID)))

/*! Parameter validity check for Backup Register Number. */
#define IS_PWC_BACKUP_REGISTER_NUMBER(num)      ((num) <= 127U)

/*! Parameter validity check for WKT Clock Source. */
#define IS_PWC_WKT_CLK_SRC(src)                                                 \
(   ((src) == PWC_WKT_CLK_SRC_64HZ)             ||                              \
    ((src) == PWC_WKT_CLK_SRC_XTAL32)           ||                              \
    ((src) == PWC_WKT_CLK_SRC_RTCLRC))

/*! Parameter validity check for WKT Comparision Value. */
#define IS_PWC_WKT_COMPARISION_VALUE(val)       ((val) <= 0x0FFFU)

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup PWC_Global_Functions PWC Global Functions
 * @{
 */
/**
 * @brief  Enter power down mode.
 * @param  None
 * @retval None
 */
void PWC_EnterPowerDownMode(void)
{
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->STPMCR_b.STOP, 1U);
    WRITE_REG32(bM4_PWC->PWRC0_b.PWDN, 1U);

    __WFI();
}

/**
 * @brief  Enter stop mode.
 * @param  None
 * @retval None
 */
void PWC_EnterStopMode(void)
{
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->STPMCR_b.STOP, 1U);

    __WFI();
}

/**
 * @brief  Enter sleep mode.
 * @param  None
 * @retval None
 */
void PWC_EnterSleepMode(void)
{
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->STPMCR_b.STOP, 0U);

     __WFI();
}

/**
 * @brief  Enable or disable the FCG0 peripheral clock.
 * @param [in] u32Fcg0Periph The peripheral in FCG0.
 *   @arg PWC_FCG0_SRAMH
 *   @arg PWC_FCG0_SRAM1
 *   @arg PWC_FCG0_SRAM2
 *   @arg PWC_FCG0_SRAM3
 *   @arg PWC_FCG0_SRAM4
 *   @arg PWC_FCG0_SRAMB
 *   @arg PWC_FCG0_KEY
 *   @arg PWC_FCG0_DMA1
 *   @arg PWC_FCG0_DMA2
 *   @arg PWC_FCG0_FCM
 *   @arg PWC_FCG0_AOS
 *   @arg PWC_FCG0_CTC
 *   @arg PWC_FCG0_CORDIC
 *   @arg PWC_FCG0_AES
 *   @arg PWC_FCG0_HASH
 *   @arg PWC_FCG0_TRNG
 *   @arg PWC_FCG0_CRC
 *   @arg PWC_FCG0_DCU1
 *   @arg PWC_FCG0_DCU2
 *   @arg PWC_FCG0_DCU3
 *   @arg PWC_FCG0_DCU4
 *   @arg PWC_FCG0_DCU5
 *   @arg PWC_FCG0_DCU6
 *   @arg PWC_FCG0_DCU7
 *   @arg PWC_FCG0_DCU8
 * @param [in] enNewState The new state of the clock output.
 *   @arg Enable
 *   @arg Disable
 * @retval None
 */
void PWC_Fcg0PeriphClockCmd(uint32_t u32Fcg0Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG0_PERIPH(u32Fcg0Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_FCG0_UNLOCKED());

