RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
    if(Enable == enNewState)
    {
        CLEAR_REG32_BIT(M4_PWC->FCG0, u32Fcg0Periph);
    }
    else
    {
        SET_REG32_BIT(M4_PWC->FCG0, u32Fcg0Periph);
    }
}

/**
 * @brief  Enable or disable the FCG1 peripheral clock.
 * @param [in] u32Fcg1Periph The peripheral in FCG1.
 *   @arg PWC_FCG1_CAN1
 *   @arg PWC_FCG1_CAN2
 *   @arg PWC_FCG1_ETHER
 *   @arg PWC_FCG1_QSPI
 *   @arg PWC_FCG1_IIC1
 *   @arg PWC_FCG1_IIC2
 *   @arg PWC_FCG1_IIC3
 *   @arg PWC_FCG1_IIC4
 *   @arg PWC_FCG1_IIC5
 *   @arg PWC_FCG1_IIC6
 *   @arg PWC_FCG1_SDIOC1
 *   @arg PWC_FCG1_SDIOC2
 *   @arg PWC_FCG1_I2S1
 *   @arg PWC_FCG1_I2S2
 *   @arg PWC_FCG1_I2S3
 *   @arg PWC_FCG1_I2S4
 *   @arg PWC_FCG1_SPI1
 *   @arg PWC_FCG1_SPI2
 *   @arg PWC_FCG1_SPI3
 *   @arg PWC_FCG1_SPI4
 *   @arg PWC_FCG1_SPI5
 *   @arg PWC_FCG1_SPI6
 *   @arg PWC_FCG1_USBFS
 *   @arg PWC_FCG1_USBHS
 *   @arg PWC_FCG1_FMAC1
 *   @arg PWC_FCG1_FMAC2
 *   @arg PWC_FCG1_FMAC3
 *   @arg PWC_FCG1_FMAC4
 * @param [in] enNewState The new state of the clock output.
 *   @arg Enable
 *   @arg Disable
 * @retval None
 */
void PWC_Fcg1PeriphClockCmd(uint32_t u32Fcg1Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG1_PERIPH(u32Fcg1Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        CLEAR_REG32_BIT(M4_PWC->FCG1, u32Fcg1Periph);
    }
    else
    {
        SET_REG32_BIT(M4_PWC->FCG1, u32Fcg1Periph);
    }
}

/**
 * @brief  Enable or disable the FCG2 peripheral clock.
 * @param [in] u32Fcg2Periph The peripheral in FCG2.
 *   @arg PWC_FCG2_TMR6_1
 *   @arg PWC_FCG2_TMR6_2
 *   @arg PWC_FCG2_TMR6_3
 *   @arg PWC_FCG2_TMR6_4
 *   @arg PWC_FCG2_TMR6_5
 *   @arg PWC_FCG2_TMR6_6
 *   @arg PWC_FCG2_TMR6_7
 *   @arg PWC_FCG2_TMR6_8
 *   @arg PWC_FCG2_TMR4_1
 *   @arg PWC_FCG2_TMR4_2
 *   @arg PWC_FCG2_TMR4_3
 *   @arg PWC_FCG2_HRPWM
 *   @arg PWC_FCG2_TMR0_1
 *   @arg PWC_FCG2_TMR0_2
 *   @arg PWC_FCG2_EMB
 *   @arg PWC_FCG2_TMR2_1
 *   @arg PWC_FCG2_TMR2_2
 *   @arg PWC_FCG2_TMR2_3
 *   @arg PWC_FCG2_TMR2_4
 *   @arg PWC_FCG2_TMRA_1
 *   @arg PWC_FCG2_TMRA_2
 *   @arg PWC_FCG2_TMRA_3
 *   @arg PWC_FCG2_TMRA_4
 *   @arg PWC_FCG2_TMRA_5
 *   @arg PWC_FCG2_TMRA_6
 *   @arg PWC_FCG2_TMRA_7
 *   @arg PWC_FCG2_TMRA_8
 *   @arg PWC_FCG2_TMRA_9
 *   @arg PWC_FCG2_TMRA_10
 *   @arg PWC_FCG2_TMRA_11
 *   @arg PWC_FCG2_TMRA_12
 * @param [in] enNewState The new state of the clock output.
 *   @arg Enable
 *   @arg Disable
 * @retval None
 */
void PWC_Fcg2PeriphClockCmd(uint32_t u32Fcg2Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG2_PERIPH(u32Fcg2Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        CLEAR_REG32_BIT(M4_PWC->FCG2, u32Fcg2Periph);
    }
    else
    {
        SET_REG32_BIT(M4_PWC->FCG2, u32Fcg2Periph);
    }
}

/**
 * @brief  Enable or disable the FCG3 peripheral clock.
 * @param [in] u32Fcg3Periph The peripheral in FCG3.
 *   @arg PWC_FCG3_ADC1
 *   @arg PWC_FCG3_ADC2
 *   @arg PWC_FCG3_ADC3
 *   @arg PWC_FCG3_CMBIAS
 *   @arg PWC_FCG3_DAC1
 *   @arg PWC_FCG3_DAC2
 *   @arg PWC_FCG3_CMP1
 *   @arg PWC_FCG3_CMP2
 *   @arg PWC_FCG3_OTS
 *   @arg PWC_FCG3_DVP
 *   @arg PWC_FCG3_SMC
 *   @arg PWC_FCG3_DMC
 *   @arg PWC_FCG3_NFC
 *   @arg PWC_FCG3_USART1
 *   @arg PWC_FCG3_USART2
 *   @arg PWC_FCG3_USART3
 *   @arg PWC_FCG3_USART4
 *   @arg PWC_FCG3_USART5
 *   @arg PWC_FCG3_USART6
 *   @arg PWC_FCG3_USART7
 *   @arg PWC_FCG3_USART8
 *   @arg PWC_FCG3_USART9
 *   @arg PWC_FCG3_USART10
 * @param [in] enNewState The new state of the clock output.
 *   @arg Enable
 *   @arg Disable
 * @retval None
 */
void PWC_Fcg3PeriphClockCmd(uint32_t u32Fcg3Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG3_PERIPH(u32Fcg3Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        CLEAR_REG32_BIT(M4_PWC->FCG3, u32Fcg3Periph);
    }
    else
    {
        SET_REG32_BIT(M4_PWC->FCG3, u32Fcg3Periph);
    }
}

/**
 * @brief RAM configuration for MCU operating mode and power down control.
 * @param [in] pstcRamConfig Pointer to a stc_pwc_ram_config_t structure that
 *                            contains configuration information.
 *   @arg u32RamCtrl Internal RAM setting for power mode.
 *        PWC_RAMPC0_RAMPDC0:       0x20000000 ~ 0x2000FFFF
 *        PWC_RAMPC0_RAMPDC1:       0x20010000 ~ 0x2001FFFF
 *        PWC_RAMPC0_RAMPDC2:       0x20020000 ~ 0x2002FFFF
 *        PWC_RAMPC0_RAMPDC3:       0x20030000 ~ 0x2003FFFF
 *        PWC_RAMPC0_RAMPDC4:       0x20040000 ~ 0x2004FFFF
 *        PWC_RAMPC0_RAMPDC5:       0x20050000 ~ 0x20057FFF
 *        PWC_RAMPC0_RAMPDC6:       0x20058000 ~ 0x2005FFFF
 *        PWC_RAMPC0_RAMPDC7:       0x1FFE0000 ~ 0x1FFE7FFF
 *        PWC_RAMPC0_RAMPDC8:       0x1FFE8000 ~ 0x1FFEFFFF
 *        PWC_RAMPC0_RAMPDC9:       0x1FFF0000 ~ 0x1FFF7FFF
 *        PWC_RAMPC0_RAMPDC10:      0x1FFF8000 ~ 0x1FFFFFFF
 *   @arg u32PRamCtrl Peripheral RAM setting for power mode.
 *        PWC_PRAMLPC_PRAMPDC0:     CAN1 RAM
 *        PWC_PRAMLPC_PRAMPDC1:     CAN2 RAM
 *        PWC_PRAMLPC_PRAMPDC2:     CACHE RAM
 *        PWC_PRAMLPC_PRAMPDC3:     USBFS RAM
 *        PWC_PRAMLPC_PRAMPDC4:     USBHS RAM
 *        PWC_PRAMLPC_PRAMPDC5:     Ethernet Tx RAM
 *        PWC_PRAMLPC_PRAMPDC6:     Ethernet Rx RAM
 *        PWC_PRAMLPC_PRAMPDC7:     SDIO1 RAM
 *        PWC_PRAMLPC_PRAMPDC8:     SDIO2 RAM
 *        PWC_PRAMLPC_PRAMPDC9:     NFC RAM
 *   @arg u16RamMode RAM setting for Operating mode.
 *        PWC_RAM_HIGH              MCU operating under high frequency (lower than 240MHz)
 *        PWC_RAM_LOW               MCU operating under low frequency (lower than 8MHz)
 * @retval Ok: RAM config successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t PWC_RamConfig(const stc_pwc_ram_config_t *pstcRamConfig)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcRamConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_PWC_RAM_CONTROL(pstcRamConfig->u32RamCtrl));
        DDL_ASSERT(IS_PWC_PRAM_CONTROL(pstcRamConfig->u32PRamCtrl));
        DDL_ASSERT(IS_PWC_RAM_MODE(pstcRamConfig->u16RamMode));
        DDL_ASSERT(IS_PWC_UNLOCKED());

        WRITE_REG32(M4_PWC->RAMPC0, pstcRamConfig->u32RamCtrl);
        WRITE_REG32(M4_PWC->PRAMLPC, pstcRamConfig->u32PRamCtrl);
        WRITE_REG16(M4_PWC->RAMOPM, pstcRamConfig->u16RamMode);
    }
    return enRet;
}

/**
 * @brief  Initialize PVD config structure. Fill each pstcPvdConfig with default value
 * @param  [in] pstcPvdConfig Pointer to a stc_pwc_pvd_config_t structure that
 *                            contains configuration information.
 * @retval Ok: PVD structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t PWC_PVD_StructInit(stc_pwc_pvd_config_t *pstcPvdConfig)
{
    en_result_t enRet = Ok;
    /* Check if pointer is NULL */
    if (NULL == pstcPvdConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Reset PVD init structure parameters values */
        pstcPvdConfig->u8PvdEn          = PWC_PVD_OFF;
        pstcPvdConfig->u8Pvd2ExtInEn    = PWC_PVD2_EXINP_OFF;
        pstcPvdConfig->u8PvdCmpOutEn    = PWC_PVD_CMP_OFF;
        pstcPvdConfig->u8PvdIntRstSel   = PWC_PVD_INT;
        pstcPvdConfig->u8PvdIntRstEn    = PWC_PVD_IR_OFF;
        pstcPvdConfig->u8FilterEn       = PWC_PVD_DF_ON;
        pstcPvdConfig->u8FilterClk      = PWC_PVD_DFS_DIV4;
        pstcPvdConfig->u8PvdVoltage     = PWC_PVD1_2V0_PVD2_2V1;
        pstcPvdConfig->u8PvdNmiEn       = PWC_PVD_INT_NONMASK;
        pstcPvdConfig->u8PvdTrigger     = PWC_PVD_TRIGGER_FALLING;
    }
    return enRet;
}

/**
 * @brief PVD configuration.
 * @param [in] u8Ch PVD channel
 *   @arg  PWC_PVD_CH1
 *   @arg  PWC_PVD_CH2
 * @param [in] pstcPvdConfig Pointer to a stc_pwc_pvd_config_t structure that
 *                            contains configuration information.
 * @retval Ok: PVD initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t PWC_PVD_Init(uint8_t u8Ch, const stc_pwc_pvd_config_t *pstcPvdConfig)
{
    en_result_t enRet = Ok;

