RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
    /* Check if pointer is NULL */
    if (NULL == pstcPvdConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_PVD_UNLOCKED());
        DDL_ASSERT(IS_PWC_PVD_CH(u8Ch));
        DDL_ASSERT(IS_PWC_PVD2_EXINP(pstcPvdConfig->u8Pvd2ExtInEn));
        DDL_ASSERT(IS_PWC_PVD_EN(pstcPvdConfig->u8PvdEn));
        DDL_ASSERT(IS_PWC_PVD_IR_EN(pstcPvdConfig->u8PvdIntRstEn));
        DDL_ASSERT(IS_PWC_PVD_IR_SEL(pstcPvdConfig->u8PvdIntRstSel));
        DDL_ASSERT(IS_PWC_PVD_CMP_EN(pstcPvdConfig->u8PvdCmpOutEn));
        DDL_ASSERT(IS_PWC_PVD_DFS_EN(pstcPvdConfig->u8FilterEn));
        DDL_ASSERT(IS_PWC_PVD_DFS_CLK(pstcPvdConfig->u8FilterClk));
        DDL_ASSERT(IS_PWC_PVD_VOLTAGE(pstcPvdConfig->u8PvdVoltage));
        DDL_ASSERT(IS_PWC_PVD_NMI(pstcPvdConfig->u8PvdNmiEn));
        DDL_ASSERT(IS_PWC_PVD_TRIG(pstcPvdConfig->u8PvdTrigger));

        if (PWC_PVD_CH1 == u8Ch)
        {
            WRITE_REG32(bM4_PWC->PVDCR0_b.PVD1EN,  pstcPvdConfig->u8PvdEn);
        }
        else
        {
            WRITE_REG32(bM4_PWC->PVDCR0_b.PVD2EN,  pstcPvdConfig->u8PvdEn);
            WRITE_REG32(bM4_PWC->PVDCR0_b.EXVCCINEN, pstcPvdConfig->u8Pvd2ExtInEn);

        }
        /* config PVDCMPOE before PVDIRE */
        MODIFY_REG8(M4_PWC->PVDCR1,                                                         \
                    (PWC_PVDCR1_PVD1CMPOE << (uint8_t)(u8Ch * 4U)),                         \
                    (pstcPvdConfig->u8PvdCmpOutEn) << (uint8_t)(u8Ch * 4U));

        MODIFY_REG8(M4_PWC->PVDCR1,                                                         \
                    (PWC_PVDCR1_PVD1IRE | PWC_PVDCR1_PVD1IRS) << (uint8_t)(u8Ch * 4U),      \
                    (pstcPvdConfig->u8PvdIntRstSel | pstcPvdConfig->u8PvdIntRstEn) << (uint8_t)(u8Ch * 4U));
        if (PWC_PVD_DF_ON == pstcPvdConfig->u8FilterEn)
        {
            /* disable filter function in advance */
            SET_REG8_BIT(M4_PWC->PVDFCR, PWC_PVDFCR_PVD1NFDIS << (uint8_t)(u8Ch * 4U));
        }
        MODIFY_REG8(M4_PWC->PVDFCR,                                                         \
                    (PWC_PVDFCR_PVD1NFDIS | PWC_PVDFCR_PVD1NFCKS) << (uint8_t)(u8Ch * 4U),  \
                    (pstcPvdConfig->u8FilterEn | pstcPvdConfig->u8FilterClk) << (uint8_t)(u8Ch * 4U));

        MODIFY_REG8(M4_PWC->PVDLCR, (PWC_PVDLCR_PVD1LVL << (uint8_t)(u8Ch * 4U)),           \
                    (pstcPvdConfig->u8PvdVoltage) << (uint8_t)(u8Ch * 4U));

        MODIFY_REG8(M4_PWC->PVDICR,                                                         \
                    (PWC_PVDICR_PVD1NMIS | PWC_PVDICR_PVD1EDGS) << (uint8_t)(u8Ch * 4U),    \
                    (pstcPvdConfig->u8PvdNmiEn | pstcPvdConfig->u8PvdTrigger) << (uint8_t)(u8Ch * 4U));
    }
    return enRet;
}

/**
 * @brief  Get PVD flag.
 * @param  [in] u8Flag PVD flag to be get
 *   @arg    PWC_PVDDSR_PVD1DETFLG: VCC across VPVD1
 *   @arg    PWC_PVDDSR_PVD2DETFLG: VCC across VPVD2
 *   @arg    PWC_PVDDSR_PVD1MON: VCC > VPVD1
 *   @arg    PWC_PVDDSR_PVD2MON: VCC > VPVD2
 * @retval An en_flag_status_t enumeration value
 *   @arg    Set
 *   @arg    Reset
 * @note   PVDxDETFLG is avaliable when PVDCR0.PVDxEN and PVDCR1.PVDxCMPOE are set to '1'
 */
en_flag_status_t PWC_PVD_GetStatus(uint8_t u8Flag)
{
    DDL_ASSERT(IS_PWC_PVD_GET_FLAG(u8Flag));
    return READ_REG8_BIT(M4_PWC->PVDDSR, u8Flag) ? Set:Reset;
}

/**
 * @brief  Clear PVD1 & PVD2 flag.
 * @param  None
 * @retval None
 */
void PWC_PVD_ClearStatus(void)
{
    DDL_ASSERT(IS_PVD_UNLOCKED());
    WRITE_REG32(bM4_PWC->PVDDSR_b.PVD1DETFLG, 0UL);
}

/**
 * @brief  Power down mode wake up event config.
 * @param  [in] u8Wkup0Evt Wakeup pin group 0 and 1.
 *  @arg    PWC_PDWKE0_WKE0_0
 *  @arg    PWC_PDWKE0_WKE0_1
 *  @arg    PWC_PDWKE0_WKE0_2
 *  @arg    PWC_PDWKE0_WKE0_3
 *  @arg    PWC_PDWKE0_WKE1_0
 *  @arg    PWC_PDWKE0_WKE1_1
 *  @arg    PWC_PDWKE0_WKE1_2
 *  @arg    PWC_PDWKE0_WKE1_3
 * @param  [in] enNewState The new state of the wakeup event.
 *  @arg Enable
 *  @arg Disable
 * @retval None
 */
void PWC_PdWakeup0Cmd(uint8_t u8Wkup0Evt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_WAKEUP0_EVENT(u8Wkup0Evt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    if(Enable == enNewState)
    {
        SET_REG8_BIT(M4_PWC->PDWKE0, u8Wkup0Evt);
    }
    else
    {
        CLEAR_REG8_BIT(M4_PWC->PDWKE0, u8Wkup0Evt);
    }
}

/**
 * @brief  Power down mode wake up event config.
 * @param  [in] u8Wkup1Evt Wakeup pin group 0 and 1.
 *  @arg    PWC_PDWKE1_WKE2_0
 *  @arg    PWC_PDWKE1_WKE2_1
 *  @arg    PWC_PDWKE1_WKE2_2
 *  @arg    PWC_PDWKE1_WKE2_3
 *  @arg    PWC_PDWKE1_WKE3_0
 *  @arg    PWC_PDWKE1_WKE3_1
 *  @arg    PWC_PDWKE1_WKE3_2
 *  @arg    PWC_PDWKE1_WKE3_3
 * @param  [in] enNewState The new state of the wakeup event.
 *  @arg Enable
 *  @arg Disable
 * @retval None
 */
void PWC_PdWakeup1Cmd(uint8_t u8Wkup1Evt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_WAKEUP1_EVENT(u8Wkup1Evt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    if(Enable == enNewState)
    {
        SET_REG8_BIT(M4_PWC->PDWKE1, u8Wkup1Evt);
    }
    else
    {
        CLEAR_REG8_BIT(M4_PWC->PDWKE1, u8Wkup1Evt);
    }
}

/**
 * @brief  Power down mode wake up event config.
 * @param  [in] u8Wkup2Evt PVD, RTC, XTAL32 and wakeup timer.
 *  @arg    PWC_PDWKE2_VD1WKE
 *  @arg    PWC_PDWKE2_VD2WKE
 *  @arg    PWC_PDWKE2_RTCPRDWKE
 *  @arg    PWC_PDWKE2_RTCALMWKE
 *  @arg    PWC_PDWKE2_XTAL32ERWKE
 *  @arg    PWC_PDWKE2_WKTMWKE
 * @param  [in] enNewState The new state of the wakeup event.
 *  @arg Enable
 *  @arg Disable
 * @retval None
 */
void PWC_PdWakeup2Cmd(uint8_t u8Wkup2Evt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_WAKEUP2_EVENT(u8Wkup2Evt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    if(Enable == enNewState)
    {
        SET_REG8_BIT(M4_PWC->PDWKE2, u8Wkup2Evt);
    }
    else
    {
        CLEAR_REG8_BIT(M4_PWC->PDWKE2, u8Wkup2Evt);
    }
}

/**
 * @brief  Power down mode wake up event trigger config.
 * @param  [in] u8WkupEvt PVD and wakeup pin.
 *  @arg    PWC_PD_WKUP_PVD1
 *  @arg    PWC_PD_WKUP_PVD2
 *  @arg    PWC_PD_WKUP_WKP0
 *  @arg    PWC_PD_WKUP_WKP1
 *  @arg    PWC_PD_WKUP_WKP2
 *  @arg    PWC_PD_WKUP_WKP3
 * @param  [in] u8TrigEdge The trigger edge.
 *  @arg PWC_PD_WKUP_FALLING
 *  @arg PWC_PD_WKUP_RISING
 * @retval None
 */
void PWC_PdWakeupTrigConfig(uint8_t u8WkupEvt, uint8_t u8TrigEdge)
{
    DDL_ASSERT(IS_PWC_WAKEUP_TRIG_EVENT(u8WkupEvt));
    DDL_ASSERT(IS_PWC_WAKEUP_TRIG(u8TrigEdge));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    if (PWC_PD_WKUP_RISING == u8TrigEdge)
    {
        SET_REG8_BIT(M4_PWC->PDWKES, u8WkupEvt);
    }
    else
    {
        CLEAR_REG8_BIT(M4_PWC->PDWKES, u8WkupEvt);
    }
}

/**
 * @brief  Get wake up event flag.
 * @param  [in] u8Flag Wake up event.
 *  @arg    PWC_PDWKF0_PTWK0F
 *  @arg    PWC_PDWKF0_PTWK1F
 *  @arg    PWC_PDWKF0_PTWK2F
 *  @arg    PWC_PDWKF0_PTWK3F
 *  @arg    PWC_PDWKF0_VD1WKF
 *  @arg    PWC_PDWKF0_VD2WKF
 * @retval en_flag_status_t
 */
en_flag_status_t PWC_GetWakeup0Status(uint8_t u8Flag)
{
    DDL_ASSERT(IS_PWC_WKUP0_FLAG(u8Flag));

    return (READ_REG8_BIT(M4_PWC->PDWKF0, u8Flag) ? Set : Reset);
}

/**
 * @brief  Get wake up event flag.
 * @param  [in] u8Flag Wake up event.
 *  @arg    PWC_PDWKF1_RTCPRDWKF
 *  @arg    PWC_PDWKF1_RTCALMWKF
 *  @arg    PWC_PDWKF1_XTAL32ERWK
 *  @arg    PWC_PDWKF1_WKTMWKF
 * @retval en_flag_status_t
 */
en_flag_status_t PWC_GetWakeup1Status(uint8_t u8Flag)
{
    DDL_ASSERT(IS_PWC_WKUP1_FLAG(u8Flag));

    return (READ_REG8_BIT(M4_PWC->PDWKF1, u8Flag) ? Set : Reset);
}

/**
 * @brief  HRC clock power config.
 * @param  [in] enNewState The new state of HRC power state.
 *  @arg Enable
 *  @arg Disable
 * @retval None
 */
void PWC_HrcPwrCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->PWRC1_b.VHRCSD, enNewState);
}

/**
 * @brief  PLLA & PLLH clock power config.
 * @param  [in] enNewState The new state of PLLA & PLLH power state.
 *  @arg Enable
 *  @arg Disable
 * @retval None
 */
void PWC_PllPwrCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

