RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
    if (Enable == enNewState)
    {
        SET_REG8_BIT(M4_PWC->PWRC1, PWC_PWRC1_VPLLSD);
    }
    else
    {
        CLEAR_REG8_BIT(M4_PWC->PWRC1, PWC_PWRC1_VPLLSD);
    }
}

/**
 * @brief  Switch high speed to ultra low speed, set the drive ability.
 * @param  None
 * @retval Ok: Mode switch successful.
 *         Error: Mode switch failure, check whether EFM was unlocked please.
 * @note   Before calling this API, please switch system clock to the required
 *         low speed frequency in advance, and make sure NO any flash program
 *         or erase operation background.
 */
en_result_t PWC_HighSpeedToLowSpeed(void)
{
    en_result_t enRet = Ok;
    uint32_t u32To;

    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_EFM->FRMC_b.LVM, 0x01UL);
    WRITE_REG16(M4_PWC->RAMOPM, PWC_RAM_LOW);

    u32To = 0x1000UL;
    while (1UL != READ_REG32(bM4_EFM->FRMC_b.LVM))
    {
        if (0UL == u32To--)
        {
            enRet = Error;
            break;
        }
    }
    if (Ok == enRet)
    {
        u32To = 0x1000UL;
        while(PWC_RAM_LOW != READ_REG16(M4_PWC->RAMOPM))
        {
            if (0UL == u32To--)
            {
                enRet = Error;
                break;
            }
        }
    }
    if (Ok == enRet)
    {
        MODIFY_REG8(M4_PWC->PWRC2, PWC_PWRC2_DDAS, 0x01UL);
        WRITE_REG8(M4_PWC->PWRC3, 0x00UL);
        MODIFY_REG8(M4_PWC->PWRC2, PWC_PWRC2_DVS ,PWC_NOR_DRV_LOW);
        DDL_DelayMS(1UL);
    }
    return enRet;
}

/**
 * @brief  Switch ultra low speed to high speed, set the drive ability.
 * @param  None
 * @retval Ok: Mode switch successful.
 *         Error: Mode switch failure, check whether EFM was unlocked please.
 * @note   After calling this API, the system clock is able to switch high frequency.
 */
en_result_t PWC_LowSpeedToHighSpeed(void)
{
    en_result_t enRet = Ok;
    uint32_t u32To;

    DDL_ASSERT(IS_PWC_UNLOCKED());

    MODIFY_REG8(M4_PWC->PWRC2, PWC_PWRC2_DDAS, 0x0FUL);
    WRITE_REG8(M4_PWC->PWRC3, 0xFFUL);
    SET_REG8_BIT(M4_PWC->PWRC2, PWC_NOR_DRV_HIGH);
    DDL_DelayMS(1UL);

    WRITE_REG32(bM4_EFM->FRMC_b.LVM, 0x00UL);
    WRITE_REG16(M4_PWC->RAMOPM, PWC_RAM_HIGH);

    u32To = 0x1000UL;
    while (0UL != READ_REG32(bM4_EFM->FRMC_b.LVM))
    {
        if (0UL == u32To--)
        {
            enRet = Error;
            break;
        }
    }
    if (Ok == enRet)
    {
        u32To = 0x1000UL;
        while(PWC_RAM_HIGH != READ_REG16(M4_PWC->RAMOPM))
        {
            if (0UL == u32To--)
            {
                enRet = Error;
                break;
            }
        }
    }
    return enRet;
}

/**
 * @brief  ADC buffer config.
 * @param  [in] enNewState The new state of ADC buffer.
 *  @arg Enable
 *  @arg Disable
 * @retval None
 */
void PWC_AdcBufCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->PWRC4_b.ADBUFE, enNewState);
}

/**
 * @brief  ADC internal channel sampling selection.
 * @param  [in] u8AdcInternVol The sampling voltage for ADC internal channel.
 *  @arg PWC_AD_INTERN_REF
 *  @arg PWC_AD_VBAT_DIV2
 * @retval None
 */
void PWC_AdcInternVolSel(uint8_t u8AdcInternVol)
{
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->PWRC4_b.ADBUFS, u8AdcInternVol);
}

/**
 * @brief  Initialize Power down mode config structure. Fill each pstcPDModeConfig with default value
 * @param  [in] pstcPDModeConfig Pointer to a stc_pwc_pd_mode_config_t structure that
 *                            contains configuration information.
 * @retval Ok: Power down mode structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t PWC_PowerDownStructInit(stc_pwc_pd_mode_config_t *pstcPDModeConfig)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcPDModeConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcPDModeConfig->u8IOState = PWC_PD_IO_STATE1;
        pstcPDModeConfig->u8PDMode = PWC_PD_MODE1;
        pstcPDModeConfig->u8WkUpSpeed = PWC_PD_WKUP_SLOW;
    }
    return enRet;
}

/**
 * @brief  Power down mode config structure.
 * @param  [in] pstcPDModeConfig Pointer to a stc_pwc_pd_mode_config_t structure that
 *                            contains configuration information.
 * @retval Ok: Power down mode config successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t PWC_PowerDownConfig(const stc_pwc_pd_mode_config_t *pstcPDModeConfig)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcPDModeConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_PWC_UNLOCKED());

        MODIFY_REG8(M4_PWC->PWRC0, (PWC_PWRC0_IORTN | PWC_PWRC0_PDMDS),         \
                    (pstcPDModeConfig->u8IOState | pstcPDModeConfig->u8PDMode));
        WRITE_REG32(bM4_PWC->PWRC1_b.PDTS, pstcPDModeConfig->u8WkUpSpeed);
    }
    return enRet;
}

/**
 * @brief Stop mode config.
 * @param [in] pstcStopConfig Chip config before entry stop mode.
 *   @arg  u8StopDrv, MCU from which speed mode entry stop mode.
 *   @arg  u16ClkKeep, System clock setting after wake-up from stop mode.
 *   @arg  u16FlashWait, Whether wait flash stable after wake-up from stop mode.
 *   @arg  u16ExBusHold, ExBus status in stop mode.
 * @retval Ok: Stop mode config successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t PWC_StopConfig(const stc_pwc_stop_mode_config *pstcStopConfig)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcStopConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_PWC_STOP_DRV(pstcStopConfig->u8StopDrv));
        DDL_ASSERT(IS_PWC_STOP_CLK(pstcStopConfig->u16ClkKeep));
        DDL_ASSERT(IS_PWC_STOP_FLASH_WAIT(pstcStopConfig->u16FlashWait));
        DDL_ASSERT(IS_PWC_STOP_EXBUS(pstcStopConfig->u16ExBusHold));

        DDL_ASSERT(IS_PWC_UNLOCKED());

        MODIFY_REG8(M4_PWC->PWRC1, PWC_PWRC1_STPDAS, pstcStopConfig->u8StopDrv);

