RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
        MODIFY_REG16(M4_PWC->STPMCR,                                            \
                    (PWC_STPMCR_EXBUSOE | PWC_STPMCR_CKSMRC | PWC_STPMCR_FLNWT),\
                    (pstcStopConfig->u16ExBusHold | pstcStopConfig->u16ClkKeep |\
                    pstcStopConfig->u16FlashWait));
    }
    return enRet;
}

/**
 * @brief  Initialize stop mode config structure. Fill each pstcStopConfig with default value
 * @param  [in] pstcStopConfig Pointer to a stc_pwc_stop_mode_config structure that
 *                            contains configuration information.
 * @retval Ok: Stop down mode structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t PWC_StopStructInit(stc_pwc_stop_mode_config *pstcStopConfig)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcStopConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcStopConfig->u8StopDrv = PWC_STOP_DRV_HIGH;
        pstcStopConfig->u16ExBusHold = PWC_STOP_EXBUS_HIZ;
        pstcStopConfig->u16ClkKeep = PWC_STOP_CLK_KEEP;
        pstcStopConfig->u16FlashWait = PWC_STOP_FLASH_WAIT;
    }
    return enRet;
}
/**
 * @brief Stop mode wake up clock config.
 * @param [in] u16ClkKeep System clock setting after wake-up from stop mode.
 *   @arg PWC_STOP_CLK_KEEP
 *   @arg PWC_STOP_CLK_MRC
 * @retval None
 */
void PWC_StopClockKeepConfig(uint16_t u16ClkKeep)
{
    DDL_ASSERT(IS_PWC_STOP_CLK(u16ClkKeep));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    MODIFY_REG16(M4_PWC->STPMCR, PWC_STPMCR_CKSMRC, u16ClkKeep);
}

/**
 * @brief Stop mode wake up flash wait config.
 * @param [in] u16FlashWait Whether wait flash stable after wake-up from stop mode.
 *   @arg PWC_STOP_FLASH_WAIT
 *   @arg PWC_STOP_FLASH_NOWAIT
 * @retval None
 */
void PWC_StopFlashWaitConfig(uint16_t u16FlashWait)
{
    DDL_ASSERT(IS_PWC_STOP_FLASH_WAIT(u16FlashWait));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    MODIFY_REG16(M4_PWC->STPMCR, PWC_STPMCR_FLNWT, u16FlashWait);
}

/**
 * @brief Stop mode ex-bus status config.
 * @param [in] u16ExBusHold ExBus status in stop mode.
 *   @arg PWC_STOP_EXBUS_HIZ
 *   @arg PWC_STOP_EXBUS_HOLD
 * @retval None
 */
void PWC_StopExBusHoldConfig(uint16_t u16ExBusHold)
{
    DDL_ASSERT(IS_PWC_STOP_EXBUS(u16ExBusHold));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    MODIFY_REG16(M4_PWC->STPMCR, PWC_STPMCR_EXBUSOE, u16ExBusHold);
}

/**
 * @brief Stop mode driver capacity config.
 * @param [in] u8StopDrv Drive capacity while enter stop mode.
 *   @arg  PWC_STOP_DRV_HIGH
 *   @arg  PWC_STOP_DRV_LOW
 * @retval None
 */
void PWC_StopDrvConfig(uint8_t u8StopDrv)
{
    DDL_ASSERT(IS_PWC_STOP_DRV(u8StopDrv));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    MODIFY_REG8(M4_PWC->PWRC1, PWC_PWRC1_STPDAS, u8StopDrv);
}

/**
 * @brief  VBAT monitor reference voltage selection.
 * @param  [in] u8RefVol                VBAT monitor reference voltage.
 *         This parameter can be one of the following values:
 *           @arg PWC_VBAT_REF_VOL_1P8V:  Vbat reference voltage is 1.8V
 *           @arg PWC_VBAT_REF_VOL_2P0V:  Vbat reference voltage is 2.0V
 * @retval None
 */
void PWC_VBAT_MonitorVolSel(uint8_t u8RefVol)
{
    /* Check parameters */
    DDL_ASSERT(IS_PWC_VBAT_REF_VOL(u8RefVol));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->PWRC4_b.VBATREFSEL, u8RefVol);
}

/**
 * @brief  Enable or Disable VBAT monitor.
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_VBAT_MonitorCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->PWRC4_b.VBATME, enNewState);
}

/**
 * @brief  Get VBAT voltage status.
 * @param  None
 * @retval uint8_t                      VBAT voltage status
 */
uint8_t PWC_VBAT_GetVolStatus(void)
{
    uint8_t u8VolSta;

    DDL_ASSERT(IS_PWC_UNLOCKED());

    u8VolSta = (uint8_t)READ_REG32(bM4_PWC->PWRC4_b.VBATMON);

    return u8VolSta;
}

/**
 * @brief  Enable or Disable VBAT measure voltage.
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_VBAT_MeasureVolCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->VBATCR_b.VBATDIVMONE, enNewState);
}

/**
 * @brief  Reset the VBAT area.
 * @param  None
 * @retval None
 */
void PWC_VBAT_Reset(void)
{
    DDL_ASSERT(IS_PWC_UNLOCKED());
    WRITE_REG8(M4_PWC->VBATRSTR, 0xA5U);
}

/**
 * @brief  Enable or Disable VBAT power.
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_VBAT_PwrCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    DDL_ASSERT(IS_PWC_UNLOCKED());
    WRITE_REG32(bM4_PWC->VBATCR_b.CSDIS, enNewState);
}

/**
 * @brief  Enable or Disable Backup RAM power.
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_BkRamPwrCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    DDL_ASSERT(IS_PWC_UNLOCKED());

    if (Enable == enNewState)
    {
        WRITE_REG32(bM4_PWC->VBATCR_b.VBTRSD, 0UL);
    }
    else
    {
        WRITE_REG32(bM4_PWC->VBATCR_b.VBTRSD, 1UL);
    }
}

/**
 * @brief  Get Backup RAM flag.
 * @param  [in] u8Flag                  Backup RAM flag.
 *         This parameter can be one or any combination of the following values:
 *           @arg PWC_BACKUP_RAM_FLAG_RAMPDF:   Backup RAM power down flag
 *           @arg PWC_BACKUP_RAM_FLAG_RAMVALID: Backup RAM read/write flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t PWC_GetBkRamStatus(uint8_t u8Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_PWC_BACKUP_RAM_FLAG(u8Flag));

    DDL_ASSERT(IS_PWC_UNLOCKED());
    if (0U != (READ_REG8_BIT(M4_PWC->VBATCR, u8Flag)))
    {
        enFlagSta = Set;
    }

