RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_pwc.c
    return enFlagSta;
}

/**
 * @brief  Write Backup register.
 * @param  [in] u8RegNum                Backup register number.
 *           @arg This parameter can be a number between Min_Data = 0 and Max_Data = 127.
 * @param  [in] u8RegVal                Value written to register
 * @retval None
 */
void PWC_WriteBackupReg(uint8_t u8RegNum, uint8_t u8RegVal)
{
    __IO uint8_t *BKR;

    /* Check parameters */
    DDL_ASSERT(IS_PWC_BACKUP_REGISTER_NUMBER(u8RegNum));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    BKR = (__IO uint8_t *)PWC_BKRx(u8RegNum);
    WRITE_REG8(*BKR, u8RegVal);
}

/**
 * @brief  Read Backup register.
 * @param  [in] u8RegNum                Backup register number.
 *           @arg This parameter can be a number between Min_Data = 0 and Max_Data = 127.
 * @retval uint8_t                      Register value
 */
uint8_t PWC_ReadBackupReg(uint8_t u8RegNum)
{
    uint8_t u8RegVal;

    /* Check parameters */
    DDL_ASSERT(IS_PWC_BACKUP_REGISTER_NUMBER(u8RegNum));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    u8RegVal = READ_REG8(*((__IO uint8_t *)PWC_BKRx(u8RegNum)));

    return u8RegVal;
}

/**
 * @brief  WKT Timer Initialize.
 * @param  [in] u8ClkSrc                Clock source.
 *         This parameter can be one of the following values:
 *           @arg PWC_WKT_CLK_SRC_64HZ:     64Hz Clock
 *           @arg PWC_WKT_CLK_SRC_XTAL32:   XTAL32 Clock
 *           @arg PWC_WKT_CLK_SRC_RTCLRC:   RTCLRC Clock
 * @param  [in] u16CmpVal               Comparison value of the Counter.
 *           @arg This parameter can be a number between Min_Data = 0 and Max_Data = 0xFFF.
 * @retval None
 */
void PWC_WKT_Init(uint8_t u8ClkSrc, uint16_t u16CmpVal)
{
    /* Check parameters */
    DDL_ASSERT(IS_PWC_WKT_CLK_SRC(u8ClkSrc));
    DDL_ASSERT(IS_PWC_WKT_COMPARISION_VALUE(u16CmpVal));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    MODIFY_REG8(M4_PWC->WKTC2, PWC_WKTC2_WKCKS, u8ClkSrc);
    WRITE_REG8(M4_PWC->WKTC0, (uint8_t)(u16CmpVal & 0x00FFU));
    WRITE_REG8(M4_PWC->WKTC1, (uint8_t)((u16CmpVal >> 8U) & 0x000FU));
}

/**
 * @brief  Set WKT Timer compare value.
 * @param  [in] u16CmpVal               Comparison value of the Counter.
 *           @arg This parameter can be a number between Min_Data = 0 and Max_Data = 0xFFF.
 * @retval None
 */
void PWC_WKT_SetCompareValue(uint16_t u16CmpVal)
{
    /* Check parameters */
    DDL_ASSERT(IS_PWC_WKT_COMPARISION_VALUE(u16CmpVal));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG8(M4_PWC->WKTC0, (uint8_t)(u16CmpVal & 0x00FFU));
    WRITE_REG8(M4_PWC->WKTC1, (uint8_t)((u16CmpVal >> 8U) & 0x000FU));
}

/**
 * @brief  Get WKT Timer compare value.
 * @param  None
 * @retval uint16_t                     WKT Compara value
 */
uint16_t PWC_WKT_GetCompareValue(void)
{
    uint16_t u16CmpVal;

    DDL_ASSERT(IS_PWC_UNLOCKED());

    u16CmpVal  = ((uint16_t)READ_REG16_BIT(M4_PWC->WKTC1, PWC_WKTC1_WKTMCMP) << 8U);
    u16CmpVal |= READ_REG8(M4_PWC->WKTC0);

    return u16CmpVal;
}

/**
 * @brief  Enable or Disable WKT Timer.
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void PWC_WKT_Cmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PWC_UNLOCKED());

    WRITE_REG32(bM4_PWC->WKTC2_b.WKTCE, enNewState);
}

/**
 * @brief  Get WKT Timer count match flag.
 * @param  None
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t PWC_WKT_GetStatus(void)
{
    en_flag_status_t enFlagSta;

    DDL_ASSERT(IS_PWC_UNLOCKED());

    enFlagSta = (en_flag_status_t)READ_REG32(bM4_PWC->WKTC2_b.WKOVF);

    return enFlagSta;
}

/**
 * @brief  Clear WKT Timer count match flag.
 * @param  None
 * @retval None
 */
void PWC_WKT_ClearStatus(void)
{
    DDL_ASSERT(IS_PWC_UNLOCKED());
    WRITE_REG32(bM4_PWC->WKTC2_b.WKOVF, 0UL);
}

/**
 * @}
 */

#endif  /* DDL_PWC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/

